# Сформувати список з 30 випадкових цілих чисел від - 100 до + 100.
# Знайти максимальний елемент списку і його порядковий номер. Вивести пари від’ємних чисел, що стоять поруч.

import random

# Створюємо новий масив і заповнюємо його випадковими значеннями від -100 до 100.
mass = [random.randint(-100, 100) for x in range(30)]
# Виводимо новий масив
print(mass)
# Оголошуємо нову змінну, яка буде рівна першому елементу із нового масиву
number = mass[0]

# Оголошуємо нову змінну-лічильник, яка потрібна, щоб "переходити" від одного елемента масиву до наступного
tmp = 0

# Знаходимо максимальний елемент у масиві
for x in range(1, len(mass)):
    if mass[x] > number:
        number = mass[tmp]
        tmp = x + 1

print(f"Найбільше число у переліку:", number, f" | Його порядковий номер:", tmp)

print(f"Пари від'ємних чисел, що стоять поруч: ")
# Знаходимо пари від'ємних чисел поруч
for x in range(x):
    if mass[x] < 0 and mass[x+1] < 0:
       print(mass[x], mass[x+1])

